; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Star9 thermograph0)
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph0)
))

)

; plan
1. (turn_to satellite1 star5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star5)
   goals met: 1 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 8
3. (calibrate satellite0 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 1 of 8
4. (turn_to satellite0 planet12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet12)
   goals met: 1 of 8
5. (take_image satellite0 planet12 instrument2 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 8
6. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 8
7. (take_image satellite0 planet11 instrument2 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 3 of 8
8. (turn_to satellite0 phenomenon8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 4 of 8
10. (turn_to satellite0 planet13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet13)
   goals met: 4 of 8
11. (take_image satellite0 planet13 instrument2 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 5 of 8
12. (turn_to satellite0 planet7 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet7)
   goals met: 5 of 8
13. (take_image satellite0 planet7 instrument2 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 6 of 8
14. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 6 of 8
15. (take_image satellite0 star10 instrument2 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 7 of 8
16. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
17. (take_image satellite0 star9 instrument2 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 8
